Repository: wp-plugins/extended-random-number-generator
Catalog: languages/random_number_generator-*.po
Languages: fr_fr, ru_ru

source: Generates a random number (for instance, useful to avoid browsers links cache)
fr_fr: G&eacute;n&egrave;re un nombre al&eacute;atoire (par exemple, utile pour &eacute;viter le cache des navigateurs)
ru_ru: Генерирует случайное число (например, можно использовать как доп. параметр в URL для предотвращения кеширования ссылок браузером)

source: %s Options
fr_fr: Options %s
ru_ru: %s Опции

source: You should reopen this page from its new parent menu!
fr_fr: Vous devriez r&eacute;ouvrir cette page depuis son nouveau menu parent&nbsp;!
ru_ru: Вам необходимо открыть эту страницу заново через её новое родительское меню!

source: General options
fr_fr: Options g&eacute;n&eacute;rales
ru_ru: Общие опции

source: Simply replace the tag %s by a random number.
fr_fr: Remplace simplement le tag %s par un nombre al√©atoire.
ru_ru: Просто замените тэг %s случайным числом.

source: Used to avoid browsers cache by inserting a random number. For instance, %1$s generates %2$s.
fr_fr: Utilis&eacute; pour &eacute;viter le cache des navigateurs en ins&eacute;rant un nombre al&eacute;atoire. Par exemple, %1$s g&eacute;n&egrave;re %2$s.
ru_ru: Используется для предотвращения кеширования ссылки браузером путём добавления к ней случайного числа. Например, %1$s генерирует %2$s.

source: my_url
fr_fr: mon_url

source: From:
fr_fr: A partir de&nbsp;:
ru_ru: От:

source: Dispay more details
fr_fr: Afficher plus de d&eacute;tails
ru_ru: Вывести больше информации

source: Lowest integer value to be returned (default: <code>%d</code>).
fr_fr: La plus petite valeur enti&egrave;re &agrave; retourner (par d&eacute;faut, <code>%d</code>).
ru_ru: Минимальное возвращаемое целое значение (по-умолчанию: <code>%d</code>).

source: To:
fr_fr: Jusqu'&agrave;&nbsp;:
ru_ru: До:

source: Highest integer value to be returned (default: <code>%d</code>).
fr_fr: La plus grande valeur enti&egrave;re &agrave; retourner (par d&eacute;faut, <code>%d</code>).
ru_ru: Максимальное возвращаемое целое значение (по-умолчанию: <code>%d</code>).

source: Format:
fr_fr: Format&nbsp;:
ru_ru: Формат:

source: Random number produced according to the formatting string above (default: <code>%s</code>).
fr_fr: Retourne un nombre al&eacute;atoire, avec le format ci-dessus (par d&eacute;faut, <code>%s</code>).
ru_ru: Случайное число, сгенерированное в соотвествии с форматом, заданным выше (по-умолчанию: <code>%s</code>).

source: See %s documentation for a description of format.
fr_fr: Voir la documentation de la fonction %s pour une description du param&egrave;tre format.
ru_ru: Смотри %s документацию для описания формата.

source: http://www.php.net/manual/en/function.sprintf.php
fr_fr: http://www.php.net/manual/fr/function.sprintf.php

source: Visit PHP: sprintf - Manual page
fr_fr: Visiter la page du manuel PHP : sprintf
ru_ru: Посетите PHP: страницу с документацией по sprintf

source: Advanced options
fr_fr: Options avanc&eacute;es
ru_ru: Продвинутые опции

source: Warning! If you change this value, you have to change all your previous used shortcode tags! Moreover, you have to, of course, not use another already existing tag caption!
fr_fr: Attention&nbsp;! Si vous changez cette valeur, vous devrez &eacute;galement changer tous les tags pr&eacute;c&eacute;demment utilis&eacute;s&nbsp;! De plus, vous devrez, bien &eacute;videmment, ne pas utiliser un code d&eacute;j&agrave; existant&nbsp;!
ru_ru: Внимание! Если вы измените это значение, вы должны будете изменить все shortcode тэги, использованные вами ранее. Более того, вы не должны, очевидно, использовать ни один из уже действующих shortcode тэгов.

source: Shortcode tag:
fr_fr: Code du tag&nbsp;:
ru_ru: Shortcode тэг:

source: Shortcode tag to replace in the contents (default: <code>%s</code>).
fr_fr: Code du tag &agrave; remplacer dans les contenus (par d&eacute;faut, <code>%s</code>).
ru_ru: Shortcode тэг для замены в тексте статьи (по-умолчанию: <code>%s</code>).

source: Plugin parent menu:
fr_fr: Menu parent de l'extension&nbsp;:
ru_ru: Родительское меню плагина:

source: Warning! If you change this value, after saving changes, it's better to navigate to the new submenu!
fr_fr: Attention&nbsp;! Si vous changez cette valeur, apr&egrave;s l'enregistrement des modifications, il est recommand&eacute; de naviguer sur le nouveau sous-menu&nbsp;!
ru_ru: Внимание! Если вы измените это значение, то после сохранения изменений, лучше использовать новое подменю!

source: Parent menu for this plugin options page (default: <code>%s</code>).
fr_fr: Menu parent pour cette page de r&eacute;glages de l'extension (par d&eacute;faut, <code>%s</code>).
ru_ru: Родительское меню для страницы установок этого плагина (по-умолчанию: <code>%s</code>).

source: Settings
fr_fr: R&eacute;glages
ru_ru: Установки

source: Save Changes
fr_fr: Enregistrer les modifications
ru_ru: Сохранить изменения

source: As this plugin is initially a sample, you can directly launch the %s from here.
fr_fr: Comme cette extension est initialement l'exemple d'un tutoriel, vous pouvez directement lancer l'%s &agrave; partir d'ici.
ru_ru: Так как этот плагин изначально, является примером, вы можете запустить %s прямо отсюда.

source: plugin editor
fr_fr: &eacute;diteur d'extension
ru_ru: редактор плагинов

source: Plugin translated by:
fr_fr: Extension traduite par&nbsp;:
ru_ru: Плагин переведен:

source: Development Version
fr_fr: Version &#946;
ru_ru: Версия в разработке

source: Changelog
fr_fr: R&eacute;visions
ru_ru: Журнал изменений

source: Rand#Gen.
fr_fr: Random Nb Gen.

source: Invalid format:
fr_fr: Format invalide&nbsp;:
ru_ru: Неверный формат:

source: http://blogs.wittwer.fr/whiler/tag/rng/
ru_ru: http://www.shinephp.com/

source: Whiler
ru_ru: ShinePHP
